In [3]:
import pandas as pd

In [2]:
 !gdown 1E3bwvYGf1ig32RmcYiWc0IXPN-mD_bI_

Downloading...
From: https://drive.google.com/uc?id=1E3bwvYGf1ig32RmcYiWc0IXPN-mD_bI_
To: C:\Users\htc\mckinsey.csv

  0%|          | 0.00/83.8k [00:00<?, ?B/s]
100%|##########| 83.8k/83.8k [00:00<00:00, 10.5MB/s]

In [5]:
df = pd.read_csv('C:/Users/htc/mckinsey.csv')

In [8]:
df

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

# Renaming the columns

In [5]:
# Ist approach is a lil' complex

df2 = df.rename({'country':'Country'},axis=1)

# But the result will be temporary only
# How do we make it permanent change? we assign it to a new identifier
# Or second way we add one more parameter inplace = True+

In [6]:
df2

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [7]:
df.rename({'population':'Population'},axis = 1, inplace = True)

In [8]:
df

          country  year  Population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [9]:
# Second approach is a easier. we will not talk about axis in this.

df.rename(columns = {'year':'Year'})

# Again this is temporary, to make it permanent we will use inplace = True
# Also we can select multiple columns

          country  Year  Population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [10]:
df.rename(columns = {'country' : 'Country', 'year' : 'Year', 'continent' : 'Continent'}, inplace = True)

In [11]:
df

          Country  Year  Population Continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [12]:

# Can we extract columns using Indices? Yes

df.columns[-1]

'gdp_cap'

In [13]:
df.columns[1]

'Year'

In [ ]:
# So can we also assign names to columns directly using indices? A BIG NOO

df.columns[1]='gdp_cap'

# Type error Index doesn't support mutable operations

In [ ]:
# But we can also change the names using the entire array, But not individually

df.columns = ['Country', 'Year', 'Population', 'Continent', 'Life_exp', 'Gdp_cap']

In [ ]:
df

# Now it has worked. And edited it completely
# But the industry experts doesn't recommend it to use this method.

# Deleting columns

In [ ]:
# Let's say if you want to experiment something with your data frame and you wish to delete some columns temporary. How would you do it?
# We will use a method df.drop()
# It will be a temporary delete. However if you wish to do it permanently you can do it using inplace = True parameter

In [ ]:
df.drop('Continent',axis=1)

# It's gone but temporary
# I will not make this permanent because I need to work on this data set

In [ ]:
# Easier way to drop your columns, Also we can select multiple columns

In [ ]:
df.drop(columns = ['Continent','Gdp_cap'])

# temporary

In [ ]:
df.drop(df.columns[-3],axis = 1)

# Creating new columns

In [15]:
df['year+7'] = df['Year']+7

In [16]:
# This is not temporary, This is permanent to delete the column you have to drop it. No other way

df

          Country  Year  Population Continent  life_exp     gdp_cap  year+7
0     Afghanistan  1952     8425333      Asia    28.801  779.445314    1959
1     Afghanistan  1957     9240934      Asia    30.332  820.853030    1964
2     Afghanistan  1962    10267083      Asia    31.997  853.100710    1969
3     Afghanistan  1967    11537966      Asia    34.020  836.197138    1974
4     Afghanistan  1972    13079460      Asia    36.088  739.981106    1979
...           ...   ...         ...       ...       ...         ...     ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306    1994
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786    1999
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960    2004
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623    2009
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298    2014

[1704 rows x 7 columns]

In [17]:
# Using python list comprehension method

df['own'] = [i for i in range(1,1705)]

# Len of index should always be equal to len of data

In [18]:
df

,Country,Year,Population,Continent,life_exp,gdp_cap,year+7,own
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,2
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,3
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,4
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,5
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,1987,9216418,Africa,62.351,706.157306,1994,1700
1700,Zimbabwe,1992,10704340,Africa,60.377,693.420786,1999,1701
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2004,1702
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2009,1703
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2014,1704

In [19]:
# One more example

df['Year'+' life_exp'] = (df['Year']+df['life_exp'])*2

In [20]:
df

,Country,Year,Population,Continent,life_exp,gdp_cap,year+7,own,Year life_exp
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1,3961.602
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,2,3974.664
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,3,3987.994
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,4,4002.040
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,5,4016.176
...,...,...,...,...,...,...,...,...,...
1699,Zimbabwe,1987,9216418,Africa,62.351,706.157306,1994,1700,4098.702
1700,Zimbabwe,1992,10704340,Africa,60.377,693.420786,1999,1701,4104.754
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2004,1702,4087.618
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2009,1703,4083.978
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2014,1704,4100.974

# Basic Operations on Rows

In [21]:
df.index

RangeIndex(start=0, stop=1704, step=1)

In [22]:
# I need to fetch the entire first row. But I'm not able to fetch it using index.
# For this we will understand the concept of Implicit/Explicit Index

df.index[0]

0

In [23]:
# Before going there, Let me see if we can change our indices?

In [24]:
df2=df.head()
df2.index=[1,2,3,4,5]

In [25]:
df2

# But this doesn't mean that we don't have our implicit index. It's always going to present by default no matter what.

,Country,Year,Population,Continent,life_exp,gdp_cap,year+7,own,Year life_exp
1,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1,3961.602
2,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,2,3974.664
3,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,3,3987.994
4,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,4,4002.040
5,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,5,4016.176

In [26]:
# Let's create our own Series and then we will mmove forward with explicit/implicit index.

In [27]:
ser = pd.Series(['a','b','c','d','e','f','g','h'])
ser

# SO the indices we are getting from this is our implicit index. By default pandas provides us.

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
dtype: object

In [28]:
ser[0]

'a'

In [29]:
ser[1]

'b'

In [30]:
# Fetch c,d,e,f
ser[2:6]

2    c
3    d
4    e
5    f
dtype: object

In [31]:
# Now let's make it confusing by creating explicit indices

ser2 = pd.Series(['a','b','c','d','e','f','g','h'],index=[1,2,3,4,5,6,7,8])
ser2

# These are our explicit indices
# Again implicit indices are always going to present here.

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
dtype: object

In [32]:
# Now let's try to fetch some elements
# Working only with explicit indices. if I say ser2[0] it will raise error

ser2[1]

'a'

In [33]:
# Now try to fetch c,d,e,f using explicit index

ser2[3:7]

# So you see this is very confusing by default it is taking implicit index for Slicing, And for Indexing it is taking explicit index.
# This is very confusing to avoid this confusion we have 2 methods. 1.) loc , 2.) iloc

4    d
5    e
6    f
7    g
dtype: object

# loc and iloc
## For explicit we use loc and for implicit we use iloc

In [34]:
ser2.loc[1]

'a'

In [35]:
# Now this is fixed but by default loc method always going to include the last element.

ser2.loc[3:7]

3    c
4    d
5    e
6    f
7    g
dtype: object

In [36]:
ser2.iloc[0]

'a'

In [37]:

# iloc will not behave like loc in terms of slicing. It is not going to take the last element
# Also iloc works only with integers. We can't put any other dtypes in iloc other than ints.
ser2.iloc[3:7]

4    d
5    e
6    f
7    g
dtype: object

In [38]:
# Interesting part
# Even if i'm using explicit index, implicit index will always be there

In [39]:
# Fetch b using iloc
ser2.iloc[1]

'b'

In [40]:
ser2.iloc[2:6]

3    c
4    d
5    e
6    f
dtype: object

In [41]:
# Let's take some complex examples

In [43]:
ser3=pd.Series(['a','b','c','d','e','f','g','h'],index = [2,6,7,5,9,8,3,1])

In [44]:
ser3

2    a
6    b
7    c
5    d
9    e
8    f
3    g
1    h
dtype: object

In [45]:
ser3.iloc[0:4]

2    a
6    b
7    c
5    d
dtype: object

In [46]:
ser3.loc[2:3]

2    a
6    b
7    c
5    d
9    e
8    f
3    g
dtype: object

In [47]:
ser3.loc[7]

'c'

In [48]:
# Can we use step size in loc ? Yes

ser3.loc[2:9:2]

2    a
7    c
9    e
dtype: object

# Assignments

In [1]:
'''

We want to add a new column named ‘imported’  (Either we can add it at the end or at the given position of the column)

We have a list called imported of length 53940 having values either 0 or 1 ; Here, values represent if the diamond is imported or not (0 = not imported, 1 = imported). 

Which of the following statements are true?

a. diamond["imported"] = imported will add column named “imported” to diamond at the last position

b. diamond.insert(3, "imported", imported) will add column named “imported” to diamond at column index 3

c. diamond.insert(10, "imported", imported) will add column named “imported” at the last position

'''

# This will not add any column. Because we have less no. of rows then our actual dataframe.
# And since we are not joining two data frame. This will raise an error

'\n\nWe want to add a new column named ‘imported’  (Either we can add it at the end or at the given position of the column)\n\nWe have a list called imported of length 53940 having values either 0 or 1 ; Here, values represent if the diamond is imported or not (0 = not imported, 1 = imported). \n\nWhich of the following statements are true?\n\na. diamond["imported"] = imported will add column named “imported” to diamond at the last position\n\nb. diamond.insert(3, "imported", imported) will add column named “imported” to diamond at column index 3\n\nc. diamond.insert(10, "imported", imported) will add column named “imported” at the last position\n\n'

In [2]:

'''

Which of the following statements are true?

a. If we want to drop few columns that aren’t useful for our analysis and say we store those column names in the list dropping_list,  df.drop(dropping_list, inplace=True, axis=1) is the code to drop the columns in the dataframe itself.

b. df.drop(columns=dropping_list, inplace=False) is the code to drop all the columns which are present in the list dropping_list in the dataframe itself.

c. If the librarian wants to retrieve a certain record using labels but he observes that the index has duplicate values. We can fix this by first finding a column that doesn’t have any duplicates (assume ‘order_id’ to be that column) using  df['Order_id'].is_unique ; If this returns true, we can use this column “Order_id” for setting the labels for rows. (Refer to documentation of is_unique to know more)

d. By using the code, df.set_index('Order_id', inplace=True) we can update the index without creating any new dataframe.

'''

# A) False
# B) False
# C) True
# D) True

"\n\nWhich of the following statements are true?\n\na. If we want to drop few columns that aren’t useful for our analysis and say we store those column names in the list dropping_list,  df.drop(dropping_list, inplace=True, axis=1) is the code to drop the columns in the dataframe itself.\n\nb. df.drop(columns=dropping_list, inplace=False) is the code to drop all the columns which are present in the list dropping_list in the dataframe itself.\n\nc. If the librarian wants to retrieve a certain record using labels but he observes that the index has duplicate values. We can fix this by first finding a column that doesn’t have any duplicates (assume ‘order_id’ to be that column) using  df['Order_id'].is_unique ; If this returns true, we can use this column “Order_id” for setting the labels for rows. (Refer to documentation of is_unique to know more)\n\nd. By using the code, df.set_index('Order_id', inplace=True) we can update the index without creating any new dataframe.\n\n"

In [9]:
'''

Given a data frame named df, what will be the output of the following code:

for x in df.columns:
    if df[x].nunique()==1:
        df.drop(x, axis=1, inplace=True)
 '''

# i don't think this code will work
# because df.columns will return as headers as index in a 1D manner, And we don't have axis = 1 for 1d

'\n\nGiven a data frame named df, what will be the output of the following code:\n\nfor x in df.columns:\n    if df[x].nunique()==1:\n        df.drop(x, axis=1, inplace=True)\n '

In [10]:

'''
Following codes are executed on the above-given data frame df

df.iloc[:2,:2]                           #line a
df.loc[:2,"Name":"Profession"]           #line b
 

From the above-given information, mark the option which is true regarding the following statements.

1. For line a, the output is the first two rows with the three columns [“Name”, “Gender”, “Profession”].

2. For line a, the output is the first two rows with the two columns [“Name”, “Gender”].

3. For line b, the output is the row with labels 0,1, and 2  with the columns [“Name”, “Gender”, “Profession”].

4. For line b, TypeError will be generated.

'''

# 1. false
# 2. True

#3. True
#4 . false

'\nFollowing codes are executed on the above-given data frame df\n\ndf.iloc[:2,:2]                           #line a\ndf.loc[:2,"Name":"Profession"]           #line b\n \n\nFrom the above-given information, mark the option which is true regarding the following statements.\n\n1. For line a, the output is the first two rows with the three columns [“Name”, “Gender”, “Profession”].\n\n2. For line a, the output is the first two rows with the two columns [“Name”, “Gender”].\n\n3. For line b, the output is the row with labels 0,1, and 2  with the columns [“Name”, “Gender”, “Profession”].\n\n4. For line b, TypeError will be generated.\n\n'